src/storage-companion.org
#+Title: 存储指南
#+INCLUDE: export-notes.org

* 介绍
** 发展历史

** 衡量评测
SAN存储需要关注六个方面:
- 功能
- 性能
- 一致性
- 可靠性
- 兼容性
- 设备利旧

* 存储产品分析
** IBM V7000
V7.8: [[http://www.redbooks.ibm.com/abstracts/sg247938.html?Open][Redbooks]]
V8.1: [[http://www.redbooks.ibm.com/Redbooks.nsf/RedpieceAbstracts/sg247938.html?Open][Redbooks]]

* 软件架构
* 驱动
** 双控互联NTB
** FC卡
** SAS卡
** 网卡
** IB卡

* SCSI协议
hello world
* BACKUP
- ALUA, AP(Active-Passive)
- VVOL, NPIV, ALUA, AA, 
- Sync Remote Copy, Async Remote Copy, Dual A-A
- FlashCopy, Clone, Backup
- Mirror, SE, Compression
- Tier, Migration
- RAID
- T10 DIF, Virtualization, Quorum Disk
- Volume, Extent, Mdisk, VL, 
- Local copy: flashcopy, clone, incremental backup
- Prepare, Copying, Full copied
* 方案
** 容灾
*** 介绍
随着科技的发展进步，信息系统已成为政府和企业运作的基石。信息系统可能因硬件故障、
电力故障、自然灾害、恐怖袭击等事件导致业务中断或数据丢失。在政务系统、金融行业、
电子商务等行业，业务中断会导致严重损失，而数据丢失将导致不可估量的后果。因此在
有限时间内保障业务恢复，是一个亟待解决的问题。中国于2007年6月14日正式发布国家
标准《[[https://www.djbh.net/webdev/file/webFiles/File/cpzg/20122616046.pdf][信息安全技术 - 信息系统灾难规范]]》GB/T 20988-2007对灾难恢复能力做出了等级
划分，共分为6级，最高等级第6级要求“远程实时备份，实现数据零丢失；具备远程集群
系统的实时监控和自动切换能力；有相应的经过完整测试和演练的灾难恢复预案”，并要求
恢复时间目标RTO在数分钟内，恢复点目标RPO为0。不同等级的容灾中心建设投入差异
巨大，政府和企业应基于业务连续性和数据重要性决定容灾等级。下表是IDC对停机时间的
损失统计：
#+ATTR_HTML: :border 2 :rules all :frame: border
|------------------------+------------+-------------------+-------------------|
| 可用性/Availability(%) | 年宕机时间 | 零售业宕机损失($) | 金融业宕机损失($) |
|------------------------+------------+-------------------+-------------------|
| <l>                    |        <r> |               <r> |               <r> |
| 99.9999                |       30秒 |               950 |            53,750 |
| 99.999                 |      5分钟 |             9,417 |           537,500 |
| 99.99                  |     52分钟 |            98,000 |         5,790,000 |
| 99.9                   |   8.75小时 |           988,750 |        56,000,000 |
| 99.5                   |   53.7小时 |         5,000,000 |       280,000,000 |
| 99                     |   87.6小时 |        10,000,000 |       560,000,000 |
|------------------------+------------+-------------------+-------------------|

“两地三中心”是业界认可的容灾建设方案。两地是指同城和异地，三中心是指生产数据
中心、同城灾备中心、异地灾备中心。部署客户主要是国内外银行等高端客户。

*** 技术点

容灾技术
用以解决
这类异常将导致严重的后果。
不同行业对业务连续性
和数据可靠性有不同的要求，

政务系统、

根据IDC统计数据，

银行系统、政务系统

分布式系统CAP理论（定理）。
多活，数据中心CAP原理：Consist, Availability, Partition
*** 两地三中心

“两地三中心”是指生产数据中心、同城灾备中心、异地灾备中心建设方案。
*** 双活
*** 关键词
- CAP
- RTO/RPO
- 
